UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СтатусыДокументовВТСД/рар_мп_СтатусыДокументовВТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СтатусыДокументовВТСД</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="872dcece-786c-416e-bfa4-4ce98df56dd6">
    <name>НомерПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусОбработкиЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыОбработкиЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d462888a-fa46-4e10-842a-8647c5c2ab42">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21767e3f-5e9d-43d3-803c-eaf6279e10db">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>рар_мп_СтатусДокументаВТСД</name>
    <type>
      <types>EnumRef.рар_мп_СтатусыДокументовВТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_ТоварыДляМаркировки</name>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Exemplar_Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЧестныйЗнак</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеГТД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="da473af6-1960-4683-b941-b8e3988be4fb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea68fa0a-5188-4f2e-b04a-9834dbc8adaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89c8c32c-ef8a-46f1-a7b4-75b2e1524d3f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Documents/рар_мп_РеестрЗаказов/рар_мп_РеестрЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рар_мп_РеестрЗаказов</name>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЗапрещеноИзменятьСоставаРеестра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_СтатусДокументаВТСД</name>
    <type>
      <types>EnumRef.рар_мп_СтатусыДокументовВТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_ЗаказыИзМаркетплейса</name>
    <attributes>
      <name>рар_мп_Заказ</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтатусЗаказа</name>
      <type>
        <types>EnumRef.рар_мп_ЯндексМаркет_СтатусыЗаказов</types>
        <types>EnumRef.рар_мп_Ozon_СтатусыЗаказов</types>
        <types>EnumRef.рар_мп_Wildberries_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтатусОбработкиЗаказа</name>
      <type>
        <types>EnumRef.рар_мп_Ozon_ПодстатусыЗаказов</types>
        <types>EnumRef.рар_мп_ЯндексМаркет_ПодстатусыЗаказов</types>
        <types>EnumRef.рар_мп_Wildberries_СтатусыОбработкиЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ПечатьЭтикетки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СкачатьЭтикетку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ПередачаНаКомиссию</name>
    <attributes>
      <name>рар_мп_Заказ</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ПередачаНаКомиссию</name>
      <type>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ТоварыИзЗаказов</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_Коробки</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_РаспределенныеТовары</name>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_МаркируемыеТовары</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Exemplar_Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЧестныйЗнак</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеГТД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_КоличествоГрузовыхМест</name>
    <attributes>
      <name>рар_мп_ИдентификаторСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоГрузовыхМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/CommonModules/РаботаСТСД/Module.bsl
Функция ЗаказКлиентаВРаботеУПользователя(ПользовательТСД, ЗаказКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка
		|	И ЗаказКлиента.рар_мп_ПользовательТСД = &ПользовательТСД
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД = ЗНАЧЕНИЕ(Перечисление.рар_мп_СтатусыДокументовВТСД.ВРаботе)";
	
	Запрос.УстановитьПараметр("ПользовательТСД", ПользовательТСД);
	Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции 

Функция РеестрЗаказовВРаботеУПользователя(ПользовательТСД, РеестрЗаказов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_РеестрЗаказов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.рар_мп_РеестрЗаказов КАК рар_мп_РеестрЗаказов
		|ГДЕ
		|	рар_мп_РеестрЗаказов.Ссылка = &Ссылка
		|	И рар_мп_РеестрЗаказов.рар_мп_ПользовательТСД = &ПользовательТСД
		|	И рар_мп_РеестрЗаказов.рар_мп_СтатусДокументаВТСД = ЗНАЧЕНИЕ(Перечисление.рар_мп_СтатусыДокументовВТСД.ВРаботе)";
	
	Запрос.УстановитьПараметр("ПользовательТСД", ПользовательТСД);
	Запрос.УстановитьПараметр("Ссылка", РеестрЗаказов.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
